app/controllers/customs/act_of_discrepancies_controller.rb

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1
---
    def invoice_parser (invoice)
      {
        id: invoice.id,
        series_and_number: invoice.series_and_number,
        note: invoice.note,
        is_closed: invoice.is_closed,
        is_conducted: invoice.is_conducted,
        date_and_time: invoice.date_and_time,
        selling_on_commission: invoice.selling_on_commission,
        strings_count: invoice.strings_count,
        total_count: invoice.total_count,
        summa: invoice.summa,
        summa_nds: invoice.summa_nds,
        summa_with_nds: invoice.summa_with_nds,
        record_summa: invoice.record_summa,
        retail_summa: invoice.retail_summa,
        pre_assessment_summa: invoice.pre_assessment_summa,
        write_down_summa: invoice.write_down_summa,
        invoice_type: InvoiceType.find(invoice.invoice_type_id),
        operation: Operation.find(invoice.operation_id),
        contract: contract_parser(Contract.find(invoice.contract_id)),
        agreement: Agreement.find(invoice.agreement_id),
        currency: Currency.find(invoice.currency_id),
        status_of_acceptance: StatusOfAcceptance.find(invoice.status_of_acceptance_id),
        status_of_booting_in_equipment: StatusOfBootingInEquipment.find(invoice.status_of_booting_in_equipment_id),
        status_of_price_tag_printing: StatusOfPriceTagPrinting.find(invoice.status_of_price_tag_printing_id)