app/controllers/customs/invoices_controller.rb

    def post_method_helper (params)
      {
        invoice_type: InvoiceType.find(params[:invoice_type_id]),
        operation: Operation.find(params[:operation_id]),
        currency: Currency.find(params[:currency_id]),
        contract: Contract.find(params[:contract_id]),
        agreement: Agreement.find(params[:agreement_id]),
        status_of_price_tag_printing: StatusOfPriceTagPrinting.find(params[:status_of_price_tag_printing_id]),
        status_of_acceptance: StatusOfAcceptance.find(params[:status_of_acceptance_id]),
        status_of_booting_in_equipment: StatusOfBootingInEquipment.find(params[:status_of_booting_in_equipment_id]),
        is_closed: params[:is_closed],
        is_conducted: params[:is_conducted],
        series_and_number: params[:series_and_number],
        date_and_time: params[:date_and_time],
        strings_count: params[:strings_count],
        total_count: params[:total_count],
        summa_nds: params[:summa_nds],
        summa_with_nds: params[:summa_with_nds],
        note: params[:note],
        selling_on_commission: params[:selling_on_commission],
        summa: params[:summa],
        retail_summa: params[:retail_summa],
        record_summa: params[:record_summa],
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 1 LIMIT 1
SELECT `operations`.* FROM `operations` WHERE `operations`.`id` = 1 LIMIT 1
SELECT `status_of_acceptances`.* FROM `status_of_acceptances` WHERE `status_of_acceptances`.`id` = 1 LIMIT 1
SELECT `status_of_booting_in_equipments`.* FROM `status_of_booting_in_equipments` WHERE `status_of_booting_in_equipments`.`id` = 1 LIMIT 1