app/controllers/guides/organizations_controller.rb

    def post_method_helper (params)
      {
        short_name: params[:short_name],
        full_name: params[:full_name],
        unp: params[:unp],
        legal_address: params[:legal_address],
        phone_or_fax: params[:phone_or_fax],
        email: params[:email],
        is_provider: params[:is_provider],
        is_buyer: params[:is_buyer],
        is_company: params[:is_company],
        ownership_form: OwnershipForm.find(params[:ownership_form_id])
---
SELECT `ownership_forms`.* FROM `ownership_forms` WHERE `ownership_forms`.`id` = 1 LIMIT 1