app/controllers/guides/p_subgroups_controller.rb

SELECT `p_groups`.* FROM `p_groups` WHERE `p_groups`.`id` = 3 LIMIT 1
---
    def post_method_helper (params)
      {
        name: params[:name],
        p_group: PGroup.find(params[:p_group_id]),
      }