app/controllers/guides/products_controller.rb

    def post_method_helper (props)
      {
        short_name: params[:short_name],
        full_name: params[:full_name],
        code: params[:code],
        rate_nds: params[:rate_nds],
        summa_nds: params[:summa_nds],
        cost: params[:cost],
        unit: Unit.find(params[:unit_id])
---
SELECT `units`.* FROM `units` WHERE `units`.`id` = 4 LIMIT 1