app/controllers/warehouses/warehouses_controller.rb

    def index
      warehouse = @model.find_each.map{|el| {id: el.id, address: el.address, organization: el.organization}}
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1

    def show
      warehouse = @model.where(params[:id]).map{|el| {id: el.id, address: el.address, organization: el.organization}}
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1

    def post_method_helper(params)
      {
        address: params[:address],
        organization: Organization.find(params[:organization_id])
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1